Tekla.Structures.Model.RebarSpacingZone.LengthEnum
The length type.

Tekla.Structures.Model.RebarSpacingZone.LengthEnum.ABSOLUTE
The length is an absolute value.

Tekla.Structures.Model.RebarSpacingZone.LengthEnum.RELATIVE
The length is a relative value.